ExprovipFuel/src/Documents/Фактура/Фактура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Фактура</name>
  <registerRecords>AccumulationRegister.ОборотыТоплива</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоставщики</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыКлиенты</registerRecords>
  <attributes>
    <name>ПоследнийНомерПечати</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>флагСчитатьСкидкуОтМестаТранзакции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикДороги</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транзакции</name>
    <attributes>
      <name>ДатаТранзакции</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Карта</name>
      <type>
        <types>CatalogRef.Карточки</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоТранзакции</name>
      <type>
        <types>CatalogRef.МестаТранзакции</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦенаСНадбавкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ФактураШаблон</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаПоставщика</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагНеУчитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПримененнаяСкидка</name>
      <type>
        <types>EnumRef.ВидСкидки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ExprovipFuel/src/InformationRegisters/АвтомобилиКарточек/АвтомобилиКарточек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвтомобилиКарточек</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </resources>
  <resources>
    <name>АвтомобильСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Карточка</name>
    <type>
      <types>CatalogRef.Карточки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/InformationRegisters/УсловияСкидокНаЗаправкахИстория/УсловияСкидокНаЗаправкахИстория.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УсловияСкидокНаЗаправкахИстория</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УсловияСкидок</name>
    <type>
      <types>CatalogRef.УсловияСкидокНаЗаправках</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/InformationRegisters/СкидкиКонтрагентов/СкидкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиКонтрагентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Скидка</name>
    <type>
      <types>CatalogRef.Скидки</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/InformationRegisters/ОсобыеУсловияКонтрагентов/ОсобыеУсловияКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсобыеУсловияКонтрагентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ИспользоватьОсобыеУсловия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/InformationRegisters/СкидкиМестТранзакций/СкидкиМестТранзакций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиМестТранзакций</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Скидка</name>
    <type>
      <types>CatalogRef.Скидки</types>
    </type>
  </resources>
  <dimensions>
    <name>МестоТранзации</name>
    <type>
      <types>CatalogRef.МестаТранзакции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/InformationRegisters/ЗначенияСкидок/ЗначенияСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСкидок</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ЗначениеСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Скидка</name>
    <type>
      <types>CatalogRef.Скидки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/InformationRegisters/ВалютыВыставленияФактур/ВалютыВыставленияФактур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВалютыВыставленияФактур</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/Enums/ВидСкидки/ВидСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСкидки</name>
  <enumValues>
    <name>НаЗаправке</name>
  </enumValues>
  <enumValues>
    <name>НаКлиенте</name>
  </enumValues>
  <enumValues>
    <name>НаКлиентеПоПоставщику</name>
  </enumValues>
  <enumValues>
    <name>НаГруппеЗаправок</name>
  </enumValues>
  <enumValues>
    <name>НаКлиентеПоНоменклатуре</name>
  </enumValues>
  <enumValues>
    <name>НаКлиентеПоПоставщикуИНоменклатуре</name>
  </enumValues>
</mdclass:Enum>

ExprovipFuel/src/Documents/ФактураШаблон/ФактураШаблон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФактураШаблон</name>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоставщика</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПапкаЗаправок</name>
    <type>
      <types>CatalogRef.МестаТранзакции</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транзакции</name>
    <attributes>
      <name>ДатаТранзакции</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Карта</name>
      <type>
        <types>CatalogRef.Карточки</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоТранзакции</name>
      <type>
        <types>CatalogRef.МестаТранзакции</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТекст</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>ТекстОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ExprovipFuel/src/Documents/Фактура/Forms/DocumentForm/Module.bsl
//@skip-check query-in-loop
//@skip-check ql-temp-table-index

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// // СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	БлокировкаЭлементов();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ВывестиИтогиПоДокументуНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьВалютуКлиента(Команда)
	УстановитьВалютуКлиентаНаСервере();
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды


&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
    
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ВывестиИтогиПоДокументу(Команда)
	ВывестиИтогиПоДокументуНаСервере();
КонецПроцедуры

// Выполняет сверку данных документа с шаблоном фактуры и показывает результаты сверки пользователю
//
// Параметры:
//   Команда - КомандаФормы
&НаКлиенте
Процедура СверкаДанныхСШаблонФактурой(Команда)
	Проверка = ПолучитьТабличныйДокументСверкиСШаблонамиФактур();
	Если Проверка.Результат Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Данные в фактурах и шаблон-фактурах равны'"));
		Возврат;
	КонецЕсли;	
	
	ТабличныйДокументСверки = Проверка.ТабличныйДокумент;
	ТабличныйДокументСверки.Показать("Сверка с шаблоном фактуры");
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
    
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// Получить структуру печати.
// 
// Возвращаемое значение:
//  Структура - См. Документы.Фактура.ПолучитьСтруктуруПечати
&НаСервере
Функция ПолучитьСтруктуруПечати()	
	Возврат Документы.Фактура.ПолучитьСтруктуруПечати(РеквизитФормыВЗначение("Объект"));
КонецФункции

// Формирует табличный документ с расхождениями между транзакциями текущей фактуры и
//  транзакциями в документах-основаниях
// (шаблонах фактур).
//
// Возвращаемое значение:
//   Структура:
//     * Результат - Булево - признак отсутствия расхождений. Истина - расхождений нет, Ложь - есть расхождения
//     * ТабличныйДокумент - ТабличныйДокумент - сформированный документ с данными о расхождениях
&НаСервере
Функция ПолучитьТабличныйДокументСверкиСШаблонамиФактур()
	Структура = Новый Структура;
	Структура.Вставить("Результат", Истина);
	Структура.Вставить("ТабличныйДокумент", Новый ТабличныйДокумент);
	
	ТаблицаТранзакций = Объект.Транзакции.Выгрузить();
	
	МассивОснований = ТаблицаТранзакций.ВыгрузитьКолонку("ДокументОснование");
	
	Если МассивОснований.Количество() = 0 Тогда
		Сообщение = НСтр("ru = 'Транзакции не имеют документов-оснований. Сверка невозможна.'");
		ВызватьИсключение(Сообщение);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаТранзакций", ТаблицаТранзакций);
	Запрос.УстановитьПараметр("МассивСсылок", МассивОснований);
	#Область ТекстЗапроса
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ФактураШаблонТранзакции.ДатаТранзакции КАК ДатаТранзакции,
	|	ФактураШаблонТранзакции.Карта КАК Карта,
	|	ФактураШаблонТранзакции.Клиент КАК Клиент,
	|	ФактураШаблонТранзакции.Автомобиль КАК Автомобиль,
	|	ФактураШаблонТранзакции.МестоТранзакции КАК МестоТранзакции,
	|	ФактураШаблонТранзакции.Продукт КАК Продукт,
	|	ФактураШаблонТранзакции.Цена КАК Цена,
	|	СУММА(ФактураШаблонТранзакции.Количество) КАК Количество,
	|	ФактураШаблонТранзакции.Ссылка КАК ШаблонФактура
	|ПОМЕСТИТЬ ВТ_ДанныеШаблоновФактур
	|ИЗ
	|	Документ.ФактураШаблон.Транзакции КАК ФактураШаблонТранзакции
	|ГДЕ
	|	ФактураШаблонТранзакции.Ссылка В (&МассивСсылок)
	|СГРУППИРОВАТЬ ПО
	|	ФактураШаблонТранзакции.Автомобиль,
	|	ФактураШаблонТранзакции.ДатаТранзакции,
	|	ФактураШаблонТранзакции.Карта,
	|	ФактураШаблонТранзакции.Клиент,
	|	ФактураШаблонТранзакции.МестоТранзакции,
	|	ФактураШаблонТранзакции.Продукт,
	|	ФактураШаблонТранзакции.Ссылка,
	|	ФактураШаблонТранзакции.Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТранзакций.ДатаТранзакции КАК ДатаТранзакции,
	|	ТаблицаТранзакций.Карта КАК Карта,
	|	ТаблицаТранзакций.Клиент КАК Клиент,
	|	ТаблицаТранзакций.Автомобиль КАК Автомобиль,
	|	ТаблицаТранзакций.МестоТранзакции КАК МестоТранзакции,
	|	ТаблицаТранзакций.Продукт КАК Продукт,
	|	ТаблицаТранзакций.Цена КАК Цена,
	|	ТаблицаТранзакций.Количество КАК Количество,
	|	ТаблицаТранзакций.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_ТаблицаТранзакцийФактуры
	|ИЗ
	|	&ТаблицаТранзакций КАК ТаблицаТранзакций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаТранзакцийФактуры.ДатаТранзакции КАК ДатаТранзакции,
	|	ВТ_ТаблицаТранзакцийФактуры.Карта КАК Карта,
	|	ВТ_ТаблицаТранзакцийФактуры.Клиент КАК Клиент,
	|	ВТ_ТаблицаТранзакцийФактуры.Автомобиль КАК Автомобиль,
	|	ВТ_ТаблицаТранзакцийФактуры.МестоТранзакции КАК МестоТранзакции,
	|	ВТ_ТаблицаТранзакцийФактуры.Продукт КАК Продукт,
	|	ВТ_ТаблицаТранзакцийФактуры.Цена КАК Цена,
	|	СУММА(ВТ_ТаблицаТранзакцийФактуры.Количество) КАК Количество,
	|	ВТ_ТаблицаТранзакцийФактуры.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_ТаблицаТранзакцийФактурыСвертка
	|ИЗ
	|	ВТ_ТаблицаТранзакцийФактуры КАК ВТ_ТаблицаТранзакцийФактуры
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаТранзакцийФактуры.Автомобиль,
	|	ВТ_ТаблицаТранзакцийФактуры.ДатаТранзакции,
	|	ВТ_ТаблицаТранзакцийФактуры.ДокументОснование,
	|	ВТ_ТаблицаТранзакцийФактуры.Карта,
	|	ВТ_ТаблицаТранзакцийФактуры.Клиент,
	|	ВТ_ТаблицаТранзакцийФактуры.МестоТранзакции,
	|	ВТ_ТаблицаТранзакцийФактуры.Продукт,
	|	ВТ_ТаблицаТранзакцийФактуры.Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеШаблоновФактур.ШаблонФактура КАК ШаблонФактура,
	|	ВТ_ДанныеШаблоновФактур.ДатаТранзакции КАК ДатаТранзакции,
	|	ВТ_ДанныеШаблоновФактур.Карта КАК Карта,
	|	ВТ_ДанныеШаблоновФактур.Клиент КАК Клиент,
	|	ВТ_ДанныеШаблоновФактур.Автомобиль КАК Автомобиль,
	|	ВТ_ДанныеШаблоновФактур.МестоТранзакции КАК МестоТранзакции,
	|	ВТ_ДанныеШаблоновФактур.Продукт КАК Продукт,
	|	ВТ_ДанныеШаблоновФактур.Количество КАК КоличествоШаблонФактура,
	|	0 КАК КоличествоФактура
	|ПОМЕСТИТЬ ВТ_ОбъединениеДанных
	|ИЗ
	|	ВТ_ДанныеШаблоновФактур КАК ВТ_ДанныеШаблоновФактур
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаТранзакцийФактурыСвертка.ДокументОснование,
	|	ВТ_ТаблицаТранзакцийФактурыСвертка.ДатаТранзакции,
	|	ВТ_ТаблицаТранзакцийФактурыСвертка.Карта,
	|	ВТ_ТаблицаТранзакцийФактурыСвертка.Клиент,
	|	ВТ_ТаблицаТранзакцийФактурыСвертка.Автомобиль,
	|	ВТ_ТаблицаТранзакцийФактурыСвертка.МестоТранзакции,
	|	ВТ_ТаблицаТранзакцийФактурыСвертка.Продукт,
	|	0,
	|	ВТ_ТаблицаТранзакцийФактурыСвертка.Количество
	|ИЗ
	|	ВТ_ТаблицаТранзакцийФактурыСвертка КАК ВТ_ТаблицаТранзакцийФактурыСвертка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбъединениеДанных.ШаблонФактура КАК ШаблонФактура,
	|	ВТ_ОбъединениеДанных.ДатаТранзакции КАК ДатаТранзакции,
	|	ВТ_ОбъединениеДанных.Карта КАК Карта,
	|	ВТ_ОбъединениеДанных.Клиент КАК Клиент,
	|	ВТ_ОбъединениеДанных.Автомобиль КАК Автомобиль,
	|	ВТ_ОбъединениеДанных.МестоТранзакции КАК МестоТранзакции,
	|	ВТ_ОбъединениеДанных.Продукт КАК Продукт,
	|	СУММА(ВТ_ОбъединениеДанных.КоличествоШаблонФактура) КАК КоличествоШаблонФактура,
	|	СУММА(ВТ_ОбъединениеДанных.КоличествоФактура) КАК КоличествоФактура
	|ПОМЕСТИТЬ ВТ_ГруппировкаОбъединенныхДанных
	|ИЗ
	|	ВТ_ОбъединениеДанных КАК ВТ_ОбъединениеДанных
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОбъединениеДанных.Автомобиль,
	|	ВТ_ОбъединениеДанных.ДатаТранзакции,
	|	ВТ_ОбъединениеДанных.Карта,
	|	ВТ_ОбъединениеДанных.Клиент,
	|	ВТ_ОбъединениеДанных.МестоТранзакции,
	|	ВТ_ОбъединениеДанных.Продукт,
	|	ВТ_ОбъединениеДанных.ШаблонФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГруппировкаОбъединенныхДанных.ШаблонФактура КАК ШаблонФактура,
	|	ВТ_ГруппировкаОбъединенныхДанных.ДатаТранзакции КАК ДатаТранзакции,
	|	ВТ_ГруппировкаОбъединенныхДанных.Карта КАК Карта,
	|	ВТ_ГруппировкаОбъединенныхДанных.Клиент КАК Клиент,
	|	ВТ_ГруппировкаОбъединенныхДанных.Автомобиль КАК Автомобиль,
	|	ВТ_ГруппировкаОбъединенныхДанных.МестоТранзакции КАК МестоТранзакции,
	|	ВТ_ГруппировкаОбъединенныхДанных.Продукт КАК Продукт,
	|	ВТ_ГруппировкаОбъединенныхДанных.КоличествоШаблонФактура КАК КоличествоШаблонФактура,
	|	ВТ_ГруппировкаОбъединенныхДанных.КоличествоФактура КАК КоличествоФактура
	|ИЗ
	|	ВТ_ГруппировкаОбъединенныхДанных КАК ВТ_ГруппировкаОбъединенныхДанных
	|ГДЕ
	|	ВТ_ГруппировкаОбъединенныхДанных.КоличествоФактура <> ВТ_ГруппировкаОбъединенныхДанных.КоличествоШаблонФактура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШаблонФактура,
	|	Клиент,
	|	Карта,
	|	ДатаТранзакции";
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = Документы.Фактура.ПолучитьМакет("РасхожденияШаблонаФактурыИФактуры");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОбластьШапка.Параметры.ПредставлениеФактуры = Объект.Ссылка;
	ТабличныйДокумент.Вывести(ОбластьШапка);

	Пока Выборка.Следующий() Цикл
		Структура.Результат = Ложь;
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	ТабличныйДокумент.ФиксацияСверху = 3;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;

	Структура.ТабличныйДокумент = ТабличныйДокумент;
	Возврат Структура;

КонецФункции	

&НаСервере
Процедура ВывестиИтогиПоДокументуНаСервере()
	ТабличныйДокументИтоги.Очистить();
	
	ТаблицаИтогов = Объект.Транзакции.Выгрузить(, "ВалютаПоставщика, Количество");
	ТаблицаИтогов.Свернуть("ВалютаПоставщика", "Количество");
	
	Макет = Документы.Фактура.ПолучитьМакет("ИтогиПоДокументу");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	
	ОбластьШапка.Параметры.ЗаголовокВалюта = "Валюта поставщика";
	ТабличныйДокументИтоги.Вывести(ОбластьШапка);
	Для Каждого СтрокаТаблицы Из ТаблицаИтогов Цикл
		ОбластьСтрока.Параметры.Валюта = СтрокаТаблицы.ВалютаПоставщика;
		ОбластьСтрока.Параметры.Количество = СтрокаТаблицы.Количество;
		
		ТабличныйДокументИтоги.Вывести(ОбластьСтрока);	
	КонецЦикла;	
	ОбластьИтог.Параметры.Количество = ТаблицаИтогов.Итог("Количество");
	ТабличныйДокументИтоги.Вывести(ОбластьИтог);
	
КонецПроцедуры

&НаСервере
Процедура БлокировкаЭлементов()
	Если Не Объект.Проведен Тогда
		//Блокируем только проведенные
		Возврат;
	КонецЕсли;
	МассивТиповИсключений = Новый Массив;
	МассивТиповИсключений.Добавить(Тип("ДекорацияФормы"));
	МассивТиповИсключений.Добавить(Тип("ДополнениеЭлементаФормы"));
	
	МассивТиповДоступность = Новый Массив;
	МассивТиповДоступность.Добавить(Тип("КнопкаФормы"));
	
	МассивЭлементовИсключений = Новый Массив;
	МассивЭлементовИсключений.Добавить(Элементы.ТранзакцииВыгрузитьНаСайт);
	МассивЭлементовИсключений.Добавить(Элементы.ТранзакцииПечать);
	МассивЭлементовИсключений.Добавить(Элементы.ТранзакцииСверкаДанныхСШаблонФактурой);
		
	Для Каждого ЭлементФормы Из Элементы Цикл
		ИмяЭлемента = ЭлементФормы.Имя;
		
		Если МассивЭлементовИсключений.Найти(ЭлементФормы) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТипЭлемента = ТипЗнч(ЭлементФормы);
		
		Если МассивТиповИсключений.Найти(ТипЭлемента) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если СтрНайти(ИмяЭлемента, "ИТК_") > 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		Если МассивТиповДоступность.Найти(ТипЭлемента) <> Неопределено Тогда
			ЭлементФормы.Доступность = Ложь;
			Продолжить;
		КонецЕсли;
		ЭлементФормы.ТолькоПросмотр = Истина;
	КонецЦикла;
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТранзакции

&НаКлиенте
Процедура ТранзакцииКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Транзакции.ТекущаяСтрока;
	КоличествоПриИзмененииНаСервере(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТранзакцииЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Транзакции.ТекущаяСтрока;
	ЦенаПриИзмененииНаСервере(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТранзакцииКартаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Транзакции.ТекущаяСтрока;
	КартаПриИзмененииНаСервере(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТранзакцииНадбавкаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Транзакции.ТекущаяСтрока;
	НадбавкаПриИзмененииНаСервере(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТранзакцииВалютаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Транзакции.ТекущаяСтрока;
	ВалютаПриИзмененииНаСервере(ТекущаяСтрока);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Очистить(Команда)
	Объект.Транзакции.Очистить();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Пересчет(Команда)
	ПересчетВсегоДокументаНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	Записать();
		
	СтруктураПечати = ПолучитьСтруктуруПечати();
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("СтруктураПечати", СтруктураПечати);
		
	ОткрытьФорму("Документ.Фактура.Форма.ПечатьФактур", СтруктураПараметров);	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНаСайт(Команда)
	ВыгрузитьНаСайтНаСервере();
	ПоказатьПредупреждение(, "Выгрузка завершена");
КонецПроцедуры

#КонецОбласти

#Область Пересчеты

&НаСервере
Процедура КоличествоПриИзмененииНаСервере(ИдентификаторСтроки)
	ТекущаяСтрока = Объект.Транзакции.НайтиПоИдентификатору(ИдентификаторСтроки);
	ПересчетНаСервере(ТекущаяСтрока, "Количество");	
КонецПроцедуры

&НаСервере
Процедура ЦенаПриИзмененииНаСервере(ИдентификаторСтроки)
	ТекущаяСтрока = Объект.Транзакции.НайтиПоИдентификатору(ИдентификаторСтроки);
	ПересчетНаСервере(ТекущаяСтрока, "Цена");	
КонецПроцедуры

&НаСервере
Процедура КартаПриИзмененииНаСервере(ИдентификаторСтроки)
	ТекущаяСтрока = Объект.Транзакции.НайтиПоИдентификатору(ИдентификаторСтроки);
	ПересчетНаСервере(ТекущаяСтрока, "Карта");
КонецПроцедуры

&НаСервере
Процедура НадбавкаПриИзмененииНаСервере(ИдентификаторСтроки)
	ТекущаяСтрока = Объект.Транзакции.НайтиПоИдентификатору(ИдентификаторСтроки);
	ПересчетНаСервере(ТекущаяСтрока, "Надбавка");
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере(ИдентификаторСтроки)
	ТекущаяСтрока = Объект.Транзакции.НайтиПоИдентификатору(ИдентификаторСтроки);
	ПересчетНаСервере(ТекущаяСтрока, "Валюта");
КонецПроцедуры

&НаСервере
Процедура ПересчетВсегоДокументаНаСервере()
	Для Каждого СтрокаТЧ Из Объект.Транзакции Цикл
		ПересчетНаСервере(СтрокаТЧ, "Все");
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПересчетНаСервере(СтрокаТЧ, ИсточникПересчета)
	СтруктураНастроек = Справочники.Настройки.ПолучитьНастройки();
	Если ИсточникПересчета = "Количество" Или ИсточникПересчета = "Цена" Тогда
		ПересчетСтрокиОтЦеныИКоличества(СтрокаТЧ, СтруктураНастроек);
	ИначеЕсли ИсточникПересчета = "Все" Тогда
		ПересчетСтрокиПолный(СтрокаТЧ, СтруктураНастроек);
	ИначеЕсли ИсточникПересчета = "Карта" Тогда
		ПересчетСтрокиОтКарты(СтрокаТЧ, СтруктураНастроек);
	ИначеЕсли ИсточникПересчета = "Надбавка" Тогда
		ПересчетСтрокиОтНадбавки(СтрокаТЧ, СтруктураНастроек);
	ИначеЕсли ИсточникПересчета = "Валюта" Тогда
		ПересчетСтрокиОтВалюты(СтрокаТЧ, СтруктураНастроек);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПересчетСтрокиОтКарты(СтрокаТЧ, СтруктураНастроек)
		СтруктураАвтомобиля = ПолучитьАвтомобильПоКарточке(СтрокаТЧ.Карта, СтрокаТЧ.ДатаТранзакции);
		СтрокаТЧ.Автомобиль = СтруктураАвтомобиля.АвтомобильСтрока();
		//Установим такую же надбавку, как у такого же клиента в предыдущих строках
		//@skip-check reading-attribute-from-database
		СтрокаТЧ.Клиент     = СтрокаТЧ.Карта.Владелец;
		ТекущаяНадбавка = СтрокаТЧ.Надбавка;
		
		МассивПоиска = Объект.Транзакции.НайтиСтроки(Новый Структура("Клиент", СтрокаТЧ.Клиент));
		Для Каждого ЭлементМассива Из МассивПоиска Цикл
			ЭлементМассива.Надбавка = ТекущаяНадбавка;
		КонецЦикла;	
		
		 СтруктураСкидки = ОпределитьСкидкуКлиента(
		 	СтрокаТЧ.Клиент,
		 	СтрокаТЧ.МестоТранзакции,
		 	СтрокаТЧ.ДатаТранзакции,
		 	СтрокаТЧ.Поставщик,
		 	СтрокаТЧ.Продукт);
		 СтрокаТЧ.Скидка = СтруктураСкидки.ЗначениеСкидки;
		 СтрокаТЧ.ПримененнаяСкидка = СтруктураСкидки.ПримененнаяСкидка;
		
		Если (СтрокаТЧ.Цена+СтрокаТЧ.Количество) <> 0 Тогда
			СтруктураНастроек = Справочники.Настройки.ПолучитьНастройки();
			ПересчетСтрокиОтЦеныИКоличества(СтрокаТЧ, СтруктураНастроек);			
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПересчетСтрокиОтНадбавки(СтрокаТЧ, СтруктураНастроек)
	Если Не Объект.флагСчитатьСкидкуОтМестаТранзакции Тогда
		МассивСтрок = Объект.Транзакции.НайтиСтроки(Новый Структура("Клиент", СтрокаТЧ.Клиент));
		Для Каждого ЭлементМассива Из МассивСтрок Цикл
			ЭлементМассива.Надбавка = СтрокаТЧ.Надбавка;
			ПересчетСтрокиОтЦеныИКоличества(ЭлементМассива, СтруктураНастроек);
		КонецЦикла;				
	Иначе   
		ТекущийКонтрагент = СтрокаТЧ.Клиент;
		ТекущаяЗаправка = СтрокаТЧ.МестоТранзакции;
		ТекущаяНадбавка = СтрокаТЧ.Надбавка;
				
		Для Каждого СтрокаТЧТекущая Из Объект.Транзакции Цикл
			//@skip-check reading-attribute-from-database
			Если ТекущийКонтрагент = СтрокаТЧТекущая.Клиент И
				ТекущаяЗаправка.Родитель = СтрокаТЧТекущая.МестоТранзакции.Родитель Тогда
					СтрокаТЧТекущая.Надбавка = ТекущаяНадбавка;
					ПересчетСтрокиОтЦеныИКоличества(СтрокаТЧТекущая, СтруктураНастроек);
			КонецЕсли;						 						
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПересчетСтрокиОтВалюты(СтрокаТЧ, СтруктураНастроек)
	ТекущийКонтрагент = СтрокаТЧ.Клиент;
	ТекущаяВалюта = СтрокаТЧ.Валюта;
	Если Не Объект.флагСчитатьСкидкуОтМестаТранзакции Тогда
		МассивСтрок = Объект.Транзакции.НайтиСтроки(Новый Структура("Клиент", ТекущийКонтрагент));
		Для Каждого ЭлементМассива Из МассивСтрок Цикл
			ЭлементМассива.Валюта = ТекущаяВалюта;
			ПересчетСтрокиОтЦеныИКоличества(ЭлементМассива, СтруктураНастроек);
		КонецЦикла;
	Иначе
		Заправка = СтрокаТЧ.МестоТранзакции;
		Для Каждого ТекущаяСтрока Из Объект.Транзакции Цикл
			//@skip-check reading-attribute-from-database
			Если ТекущийКонтрагент = ТекущаяСтрока.Клиент И Заправка.Родитель = ТекущаяСтрока.МестоТранзакции.Родитель Тогда
				ТекущаяСтрока.Валюта = ТекущаяВалюта;
				ПересчетСтрокиОтЦеныИКоличества(ТекущаяСтрока, СтруктураНастроек);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры		

&НаСервере
Процедура ПересчетСтрокиПолный(СтрокаТЧ, СтруктураНастроек)
	Если СтрокаТЧ.ЭтапОплаты <> 0 Тогда
		Возврат;
	КонецЕсли;	
	СтруктураКурса = Справочники.Валюты.ПолучитьСруктуруКурса(СтрокаТЧ.Валюта, СтрокаТЧ.ДатаТранзакции);
	Если СтруктураКурса.Курс = 0 Тогда
		Возврат;
	КонецЕсли;	
	ПересчетСтрокиОтЦеныИКоличества(СтрокаТЧ, СтруктураНастроек);	
КонецПроцедуры

// Получить автомобиль по карточке.
// 
// Параметры:
//  Карточка - СправочникСсылка.Карточки
//  ДатаЗапроса - Дата
// 
// Возвращаемое значение:
//  Структура - Получить автомобиль по карточке:
// * Автомобиль - СправочникСсылка.Автомобили - 
// * АвтомобильСтрока - Строка -
&НаСервере 
Функция ПолучитьАвтомобильПоКарточке(Карточка, ДатаЗапроса)
	Структура = Новый Структура;
	Структура.Вставить("Автомобиль", Справочники.Автомобили.ПустаяСсылка());
	Структура.Вставить("АвтомобильСтрока", "");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);
	Запрос.УстановитьПараметр("КарточкаСсылка", Карточка);
	Запрос.Текст = "ВЫБРАТЬ
	|	АвтомобилиКарточекСрезПоследних.Автомобиль,
	|	АвтомобилиКарточекСрезПоследних.АвтомобильСтрока
	|ИЗ
	|	РегистрСведений.АвтомобилиКарточек.СрезПоследних(&ДатаЗапроса, Карточка = &КарточкаСсылка) КАК
	|		АвтомобилиКарточекСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Структура.Автомобиль = Выборка.Автомобиль;
		Структура.АвтомобильСтрока = Выборка.АвтомобильСтрока;
	КонецЕсли;	 
	
	Возврат Структура;
КонецФункции	

// Определить скидку клиента.
// 
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Контрагент
//  МестоТранзакции - СправочникСсылка.МестаТранзакции - Место транзакции
//  ДатаТранзакции - Дата - Дата транзакции
//  Поставщик - СправочникСсылка.Контрагенты - Поставщик
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
// 
// Возвращаемое значение:
//  Структура - Определить скидку клиента:
// * ЗначениеСкидки - Число - 
// * ПримененнаяСкидка - ПеречислениеСсылка.ВидСкидки - 
&НаСервере
Функция ОпределитьСкидкуКлиента(Контрагент, МестоТранзакции, ДатаТранзакции, Поставщик, Номенклатура)
	СтруктураСкидки = Новый Структура;
	СтруктураСкидки.Вставить("ЗначениеСкидки", 0);
	СтруктураСкидки.Вставить("ПримененнаяСкидка", Перечисления.ВидСкидки.ПустаяСсылка());
	
	СкидкаНаЗаправке = 0;
	// Ищем особую скидку для клиента на конкретном месте транзакции.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("МестоТранзакции", МестоТранзакции);
	Запрос.УстановитьПараметр("ДатаЗапроса", Объект.Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УсловияСкидокНаЗаправкахИсторияСрезПоследних.Скидка КАК ЗначениеСкидки
	|ИЗ
	|	РегистрСведений.УсловияСкидокНаЗаправкахИстория.СрезПоследних(&ДатаЗапроса, УсловияСкидок.Владелец = &МестоТранзакции
	|	И УсловияСкидок.Контрагент = &Контрагент) КАК УсловияСкидокНаЗаправкахИсторияСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СкидкаНаЗаправке = Выборка.ЗначениеСкидки;
	КонецЕсли;
	
	СкидкаНаКлиенте = 0;
	// Ищем скидку клиента по конкретному поставщику:
	// сначала для текущей номенклатуры, затем общую без указания номенклатуры.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПериодЗапроса", ДатаТранзакции);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкидкиКонтрагентовСрезПоследних.Скидка КАК ВидСкидки,
	|	ВЫБОР
	|		КОГДА СкидкиКонтрагентовСрезПоследних.Номенклатура = &Номенклатура
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПриоритетНоменклатуры
	|ИЗ
	|	РегистрСведений.СкидкиКонтрагентов.СрезПоследних(&ПериодЗапроса, Контрагент = &Контрагент
	|	И Поставщик = &Поставщик
	|	И Номенклатура В (&Номенклатура, &ПустаяНоменклатура)) КАК СкидкиКонтрагентовСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриоритетНоменклатуры";
	Выборка = Запрос.Выполнить().Выбрать();
	ВидСкидки = Справочники.Скидки.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		Если Выборка.ПриоритетНоменклатуры = 0 Тогда
			СтруктураСкидки.ПримененнаяСкидка = Перечисления.ВидСкидки.НаКлиентеПоПоставщикуИНоменклатуре;
		Иначе
			СтруктураСкидки.ПримененнаяСкидка = Перечисления.ВидСкидки.НаКлиентеПоПоставщику;
		КонецЕсли;
		ВидСкидки = Выборка.ВидСкидки;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидСкидки) Тогда
		// Если скидка по поставщику не найдена, ищем общую скидку клиента:
		// сначала для текущей номенклатуры, затем без указания номенклатуры.
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПериодЗапроса", ДатаТранзакции);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Поставщик", Справочники.Контрагенты.ПустаяСсылка());
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СкидкиКонтрагентовСрезПоследних.Скидка КАК ВидСкидки,
		|	ВЫБОР
		|		КОГДА СкидкиКонтрагентовСрезПоследних.Номенклатура = &Номенклатура
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПриоритетНоменклатуры
		|ИЗ
		|	РегистрСведений.СкидкиКонтрагентов.СрезПоследних(&ПериодЗапроса, Контрагент = &Контрагент
		|	И Поставщик = &Поставщик
		|	И Номенклатура В (&Номенклатура, &ПустаяНоменклатура)) КАК СкидкиКонтрагентовСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриоритетНоменклатуры";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ВидСкидки = Выборка.ВидСкидки;
			Если Выборка.ПриоритетНоменклатуры = 0 Тогда
				СтруктураСкидки.ПримененнаяСкидка = Перечисления.ВидСкидки.НаКлиентеПоНоменклатуре;
			Иначе
				СтруктураСкидки.ПримененнаяСкидка = Перечисления.ВидСкидки.НаКлиенте;
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;
	СкидкаНаКлиенте = ПолучитьЗначениеСкидкиПоВидуСкидки(ВидСкидки, ДатаТранзакции);
	
	//@skip-check reading-attribute-from-database
	СкидкаНаГруппеЗаправок = ПолучитьЗначениеСкидкиНаЗаправке(МестоТранзакции.Родитель, ДатаТранзакции);
	
	Если ПолучитьФлагНеИспользоватьОсобыеУсловияПоКонтрагенту(Контрагент, ДатаТранзакции) Тогда
		СкидкаНаЗаправке = 0;
	КонецЕсли;	
	Если СкидкаНаЗаправке <> 0 Тогда
		СтруктураСкидки.ПримененнаяСкидка = Перечисления.ВидСкидки.НаЗаправке;
		СтруктураСкидки.ЗначениеСкидки = СкидкаНаЗаправке;
		Возврат СтруктураСкидки;
	Иначе
		Если СкидкаНаКлиенте <= СкидкаНаГруппеЗаправок Тогда
			СтруктураСкидки.ЗначениеСкидки = СкидкаНаКлиенте;
		Иначе
			СтруктураСкидки.ЗначениеСкидки = СкидкаНаГруппеЗаправок;
			СтруктураСкидки.ПримененнаяСкидка = Перечисления.ВидСкидки.НаГруппеЗаправок;
		КонецЕсли;			
		Возврат СтруктураСкидки;
	КонецЕсли;
КонецФункции

// Получить флаг не использовать особые условия по контрагенту.
// 
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты
//  ДатаЗапроса - Дата
// 
// Возвращаемое значение:
//  Булево
&НаСервере
Функция ПолучитьФлагНеИспользоватьОсобыеУсловияПоКонтрагенту(Контрагент, ДатаЗапроса)
	ФлагНеИспользоватьОсобыеУсловия = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);
	Запрос.Текст = "ВЫБРАТЬ
	|	ОсобыеУсловияКонтрагентовСрезПоследних.НеИспользоватьОсобыеУсловия
	|ИЗ
	|	РегистрСведений.ОсобыеУсловияКонтрагентов.СрезПоследних(&ДатаЗапроса, Контрагент = &Контрагент) КАК
	|		ОсобыеУсловияКонтрагентовСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ФлагНеИспользоватьОсобыеУсловия = Выборка.НеИспользоватьОсобыеУсловия;
	КонецЕсли;
	Возврат ФлагНеИспользоватьОсобыеУсловия;		
КонецФункции	

// Получить значение скидки на заправке.
// 
// Параметры:
//  МестоТранзакции - СправочникСсылка.МестаТранзакции
//  ДатаЗапроса - Дата
// 
// Возвращаемое значение:
//  Число - Получить значение скидки на заправке
&НаСервере
Функция ПолучитьЗначениеСкидкиНаЗаправке(МестоТранзакции, ДатаЗапроса)
	ЗначениеСкидкиНаЗаправке = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МестоТранзакции", МестоТранзакции);
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);
	Запрос.Текст = "ВЫБРАТЬ
	|	СкидкиМестТранзакцийСрезПоследних.Скидка КАК ВидСкидки
	|ИЗ
	|	РегистрСведений.СкидкиМестТранзакций.СрезПоследних(&ДатаЗапроса, МестоТранзации = &МестоТранзакции) КАК
	|		СкидкиМестТранзакцийСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеСкидкиНаЗаправке = ПолучитьЗначениеСкидкиПоВидуСкидки(Выборка.ВидСкидки, ДатаЗапроса);
	КонецЕсли;
	Возврат ЗначениеСкидкиНаЗаправке;	
	
КонецФункции	

//
// Получить значение скидки по виду скидки.
// 
// Параметры:
//  ВидСкидки - СправочникСсылка.Скидки
//  ДатаЗапроса - Дата
// 
// Возвращаемое значение:
//  Число
&НаСервере
Функция ПолучитьЗначениеСкидкиПоВидуСкидки(ВидСкидки, ДатаЗапроса)
	ЗначениеСкидки = 0;
	
	ЗапросСкидкаПоВидуСкидки = Новый Запрос;
	ЗапросСкидкаПоВидуСкидки.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);
	ЗапросСкидкаПоВидуСкидки.УстановитьПараметр("ВидСкидки", ВидСкидки);
	ЗапросСкидкаПоВидуСкидки.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСкидокСрезПоследних.ЗначениеСкидки
	|ИЗ
	|	РегистрСведений.ЗначенияСкидок.СрезПоследних(&ДатаЗапроса, Скидка = &ВидСкидки) КАК ЗначенияСкидокСрезПоследних";
	Выборка = ЗапросСкидкаПоВидуСкидки.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеСкидки = Выборка.ЗначениеСкидки; 
	КонецЕсли;
	Возврат ЗначениеСкидки;	
КонецФункции	

&НаСервере
Процедура ПересчетСтрокиОтЦеныИКоличества(СтрокаТЧ, СтруктураНастроек)
	СписокПересчитанныхСтрок.Добавить(СтрокаТЧ.ПолучитьИдентификатор());
	
	СтруктураСкидки = ОпределитьСкидкуКлиента(
		СтрокаТЧ.Клиент,
		СтрокаТЧ.МестоТранзакции,
		СтрокаТЧ.ДатаТранзакции,
		СтрокаТЧ.Поставщик,
		СтрокаТЧ.Продукт);
	СтрокаТЧ.Скидка = СтруктураСкидки.ЗначениеСкидки;
	СтрокаТЧ.ПримененнаяСкидка = СтруктураСкидки.ПримененнаяСкидка;
	Если СтрокаТЧ.ВалютаПоставщика <> СтруктураНастроек.BYN Тогда
		СтруктураКурса = Справочники.Валюты.ПолучитьСруктуруКурса(СтрокаТЧ.Валюта, СтрокаТЧ.ДатаТранзакции);
		СтрокаТЧ.ВалютнаяЦена = СтрокаТЧ.Цена / СтруктураКурса.Курс;
	Иначе
		СтруктураКурса = Справочники.Валюты.ПолучитьСруктуруКурса(СтрокаТЧ.ВалютаПоставщика, СтрокаТЧ.ДатаТранзакции);
		ШаблонСообщения = "Для валюты %1 %2 равен нулю";
		Если СтрокаТЧ.Валюта = СтруктураНастроек.EUR Тогда
			Если СтруктураКурса.КурсКЕвро <> 0 Тогда				
				СтрокаТЧ.ВалютнаяЦена = СтрокаТЧ.Цена / СтруктураКурса.КурсКЕвро;
			Иначе
				Сообщение = СтрШаблон(ШаблонСообщения, СтрокаТЧ.ВалютаПоставщика, "курс к евро");
				ОбщегоНазначения.СообщитьПользователю(Сообщение);
				Возврат;	
			КонецЕсли;		
		Иначе
			Если СтруктураКурса.КурсКДоллару <> 0 Тогда
				СтрокаТЧ.ВалютнаяЦена = СтрокаТЧ.Цена / СтруктураКурса.КурсКДоллару;
			Иначе
				Сообщение = СтрШаблон(ШаблонСообщения, СтрокаТЧ.ВалютаПоставщика, "курс к доллару");
				ОбщегоНазначения.СообщитьПользователю(Сообщение);
				Возврат;
			КонецЕсли;			
		КонецЕсли;	
	КонецЕсли;
	СтрокаТЧ.ВалютнаяЦенаСНадбавкой = СтрокаТЧ.ВалютнаяЦена + (СтрокаТЧ.ВалютнаяЦена * СтрокаТЧ.Надбавка / 100);
	СтрокаТЧ.Сумма           = СтрокаТЧ.ВалютнаяЦенаСНадбавкой  * СтрокаТЧ.Количество;	
	СтрокаТЧ.ЦенаСоСкидкой   = СтрокаТЧ.ВалютнаяЦенаСНадбавкой  * (100 -СтрокаТЧ.Скидка)/100;
	СтрокаТЧ.СуммаСкидки     = СтрокаТЧ.Сумма * СтрокаТЧ.Скидка / 100;
	СтрокаТЧ.Итого           = СтрокаТЧ.Сумма * (100 - СтрокаТЧ.Скидка) / 100;
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаНаСайт

&НаСервере
Процедура ВыгрузитьНаСайтНаСервере()
	СтруктураНастроек = Справочники.Настройки.ПолучитьНастройки();
	Если ПустаяСтрока(СтруктураНастроек.ПутьДляВыгрузки) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан общий путь выгрузки. См. справочник ""Настройки""");
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(СтруктураНастроек.ПутьДляВыгрузкиИнвойсов) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан общий путь выгрузки инвойсов. См. справочник ""Настройки""");
		Возврат;
	КонецЕсли;	
	
	ТаблицаДанные = Объект.Транзакции.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанные", ТаблицаДанные);
	#Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанные.ДатаТранзакции,
	|	ТаблицаДанные.Карта,
	|	ТаблицаДанные.Автомобиль,
	|	ТаблицаДанные.Продукт,
	|	ТаблицаДанные.Количество,
	|	ТаблицаДанные.Цена,
	|	ТаблицаДанные.Сумма,
	|	ТаблицаДанные.Скидка,
	|	ТаблицаДанные.МестоТранзакции,
	|	ТаблицаДанные.Клиент
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&ТаблицаДанные КАК ТаблицаДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.ДатаТранзакции КАК ДатаТранзакции,
	|	ВТ_Данные.Карта,
	|	ВТ_Данные.Автомобиль,
	|	ВТ_Данные.Продукт КАК Продукт,
	|	ВТ_Данные.Количество,
	|	ВТ_Данные.Цена,
	|	ВТ_Данные.Сумма,
	|	ВТ_Данные.Скидка,
	|	ВТ_Данные.МестоТранзакции,
	|	ВТ_Данные.Клиент КАК Клиент,
	|	ЕСТЬNULL(Контрагенты.Логин, """") КАК Логин
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТ_Данные.Клиент = Контрагенты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаТранзакции,
	|	Продукт
	|ИТОГИ
	|	МАКСИМУМ(Логин) КАК Логин
	|ПО
	|	Клиент";
	#КонецОбласти
	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Клиент");
	Пока ВыборкаКонтрагент.Следующий() Цикл
		Если ПустаяСтрока(ВыборкаКонтрагент.Логин) Тогда
			Сообщение = СтрШаблон("Не указан логин для клиента: %1. Пропуск", ВыборкаКонтрагент.Клиент);
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
			Продолжить;
		КонецЕсли;	
		ТаблицаВыгрузки = ТаблицаДляВыгрузкиКонтрагента();
		Выборка = ВыборкаКонтрагент.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
			НоваяСтрока.DATE = Формат(Выборка.ДатаТранзакции, "ДФ=dd.MM.yyyy;");
			НоваяСтрока.KART = Выборка.Карта;
			НоваяСтрока.AVTO = СокрЛП(Выборка.Автомобиль);
			НоваяСтрока.MESTO = Выборка.МестоТранзакции;
			НоваяСтрока.PRODUCT = Выборка.Продукт;
			НоваяСтрока.VID = "";
			НоваяСтрока.LITR = Выборка.Количество;
			НоваяСтрока.PRICE = Выборка.Цена;
			НоваяСтрока.SUMMA = Выборка.Сумма;
			НоваяСтрока.SKIDKA = Выборка.Скидка;			
		КонецЦикла;	
		ИмяФайла = Exprovip.СформироватьИмяФайла(ВыборкаКонтрагент.Логин, СтруктураНастроек.ПутьДляВыгрузкиИнвойсов, "csv");
		Попытка
			Exprovip.ВыгрузитьТаблицуВCSV(ТаблицаВыгрузки, ";", ИмяФайла);
		Исключение
			ТекстСообщения = СтрШаблон("Ошибка выгрузки %1. Ошибка:%2", ВыборкаКонтрагент.Клиент, ОписаниеОшибки());
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;		
	КонецЦикла;		
КонецПроцедуры

// Таблица для выгрузки контрагента.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица для выгрузки контрагента:
// * DATE - Строка  
// * KART - Строка 
// * AVTO - Строка
// * MESTO - Строка
// * PRODUCT - Строка
// * VID - Строка
// * LITR - Строка
// * PRICE - Строка
// * SUMMA - Строка
// * SKIDKA - Строка
&НаСервере
Функция ТаблицаДляВыгрузкиКонтрагента()
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("DATE");
	Таблица.Колонки.Добавить("KART");
	Таблица.Колонки.Добавить("AVTO");
	Таблица.Колонки.Добавить("MESTO");
	Таблица.Колонки.Добавить("PRODUCT");
	Таблица.Колонки.Добавить("VID");
	Таблица.Колонки.Добавить("LITR");
	Таблица.Колонки.Добавить("PRICE");
	Таблица.Колонки.Добавить("SUMMA");
	Таблица.Колонки.Добавить("SKIDKA");
	
	Возврат Таблица;
КонецФункции

&НаСервере
Процедура УстановитьВалютуКлиентаНаСервере()
	СписокПересчитанныхСтрок.Очистить();
	
	СоответствиеВалютыКлиентов = ПолучитьСоответствиеВалютыКлиентов();
	
	Для Каждого СтрокаТЧ Из Объект.Транзакции Цикл
		ИДСтроки = СтрокаТЧ.ПолучитьИдентификатор();
		СтрокаТЧ.Валюта = СоответствиеВалютыКлиентов.Получить(СтрокаТЧ.Клиент);
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Валюта) Тогда
			Продолжить;
		КонецЕсли;
		Если СписокПересчитанныхСтрок.НайтиПоЗначению(ИДСтроки) <> Неопределено Тогда
			//Пересчитанную строку помещаем в кэш и заново не пересчитываем
			Продолжить;
		КонецЕсли;	
		ВалютаПриИзмененииНаСервере(СтрокаТЧ.ПолучитьИдентификатор());
	КонецЦикла;
	Объект.Транзакции.Сортировать("Клиент, ДатаТранзакции");
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеВалютыКлиентов()
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЗапроса", Объект.Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВалютыВыставленияФактурСрезПоследних.Контрагент КАК Контрагент,
	|	ВалютыВыставленияФактурСрезПоследних.Валюта КАК Валюта
	|ИЗ
	|	РегистрСведений.ВалютыВыставленияФактур.СрезПоследних(&ДатаЗапроса, ) КАК ВалютыВыставленияФактурСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Контрагент, Выборка.Валюта);
	КонецЦикла;
	
	Возврат Соответствие;
КонецФункции

#КонецОбласти
